netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_attach_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:messages_2014_1.platform.webservices.netsuite.com"
                  xmlns:urn1="urn:core_2014_1.platform.webservices.netsuite.com">
    <soapenv:Header>
        <urn:preferences>
            <urn:warningAsError></urn:warningAsError>
            <urn:disableMandatoryCustomFieldValidation></urn:disableMandatoryCustomFieldValidation>
            <urn:disableSystemNotesForCustomFields></urn:disableSystemNotesForCustomFields>
            <urn:ignoreReadOnlyFields></urn:ignoreReadOnlyFields>
        </urn:preferences>
        <urn:partnerInfo>
            <urn:partnerId></urn:partnerId>
        </urn:partnerInfo>
        <urn:applicationInfo>
            <urn:applicationId></urn:applicationId>
        </urn:applicationInfo>
        <urn:passport>
            <urn1:email>%s(email)</urn1:email>
            <urn1:password>%s(password)</urn1:password>
            <urn1:account>%s(account)</urn1:account>
            <urn1:role>
                <urn1:name></urn1:name>
            </urn1:role>
        </urn:passport>
    </soapenv:Header>
    <soapenv:Body>
        <urn:attach>
            <attachReferece xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:AttachContactReference"
                            xmlns:ns1="urn:core_2014_1.platform.webservices.netsuite.com">
                <ns1:attachTo internalId="%s(attachCustomerInternalId)" type="customer" xsi:type="ns1:RecordRef">
                    <ns1:name xsi:type="xsd:string">Acera</ns1:name>
                </ns1:attachTo>
                <ns1:contact internalId="%s(attachContactInternalId)" xsi:type="ns1:RecordRef"/>
                <ns1:contactRole internalId="-10" xsi:type="ns1:RecordRef">
                    <ns1:name xsi:type="xsd:string">Primary Contact</ns1:name>
                </ns1:contactRole>
            </attachReferece>
        </urn:attach>
    </soapenv:Body>
</soapenv:Envelope>